In [87]:
import pandas as pd

In [88]:
## types of pandas data structure :

# 1 -  series
# 2 -  dataframe

In [89]:
## series :
# series having it's by befault index (access label)

In [90]:
s = pd.Series(['mira' , 'priya' , 'dhara' , 'disha'])

In [91]:
s

0     mira
1    priya
2    dhara
3    disha
dtype: object

In [92]:
type(s)

pandas.core.series.Series

In [93]:
len(s)

4

In [94]:
 # we can also define our own index

In [95]:
s = pd.Series(['mira' , 'priya' , 'dhara' , 'disha'] , index = ['a' , 'b' , 'c' , 'd'])

In [96]:
s

a     mira
b    priya
c    dhara
d    disha
dtype: object

In [97]:
## creating series from list data structure :
country = ['Ind' , 'Aus' , 'NZ' ,'US']    # series index
cost    = [10000 ,20000 ,30000 , 40000]   # series data

In [98]:
pd.Series(cost , index = country)

Ind    10000
Aus    20000
NZ     30000
US     40000
dtype: int64

In [99]:
## creating series from tuple data structure :
country = ('Ind' , 'Aus' , 'NZ' ,'US')   # series index
cost    = (10000 ,20000 ,30000 , 40000)   # series data

In [100]:
pd.Series(cost , index = country)

Ind    10000
Aus    20000
NZ     30000
US     40000
dtype: int64

In [101]:
## creating series from dictonary data structure :
data = {'Ind' : 10000 , 'Aus' : 20000 , 'NZ' : 30000 ,'US' : 40000}

In [102]:
pd.Series(data)

Ind    10000
Aus    20000
NZ     30000
US     40000
dtype: int64

In [103]:
## dataframe :

In [104]:
# creating dataframe from the dictonary :
Employeedata = {
    'id' : [101 , 102 , 103] ,
    'name' : ['mira' , 'isha' , 'riya'] , 
    'age' : [32 , 45 , 48] , 
    'city' : ['Goa' , 'Agra' , 'Delhi']
}

In [105]:
# dataframe having it's by befault index (access label)
df = pd.DataFrame(Employeedata)

In [106]:
df

    id  name  age   city
0  101  mira   32    Goa
1  102  isha   45   Agra
2  103  riya   48  Delhi

In [107]:
df = pd.DataFrame(Employeedata , index = ['a' , 'b' , 'c'])

In [108]:
df

    id  name  age   city
a  101  mira   32    Goa
b  102  isha   45   Agra
c  103  riya   48  Delhi

In [109]:
# play with dataset
df  = pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

In [110]:
a = df['Age'][0:6]
a

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
Name: Age, dtype: float64

In [111]:
# column ko series bna k usko khud ka index diya
b = pd.Series(list(a) , index= ['a' , 'b' ,'c' ,'d' ,'e' ,'f'])
b

a    22.0
b    38.0
c    26.0
d    35.0
e    35.0
f     NaN
dtype: float64

In [112]:
b["c"]   #    a["c"] == a[2]

26.0

In [113]:
s1 = pd.Series([11,22,33,44,55] , index =[1,2,3,4,5])

In [114]:
s1

1    11
2    22
3    33
4    44
5    55
dtype: int64

In [115]:
s2 = pd.Series([111,222,333,444,555] , index =[5,4,3,2,1])

In [116]:
s2

5    111
4    222
3    333
2    444
1    555
dtype: int64

In [135]:
##append 1 series into another series
s1.append(s2)

C:\Users\win-11\AppData\Local\Temp\ipykernel_6040\1498611220.py:2: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  s1.append(s2)

1     11
2     22
3     33
4     44
5     55
5    111
4    222
3    333
2    444
1    555
dtype: int64

In [118]:
## 2 series mathi same index in values no ( +  , -  , * ) operations krshe

In [119]:
s1

1    11
2    22
3    33
4    44
5    55
dtype: int64

In [120]:
s2

5    111
4    222
3    333
2    444
1    555
dtype: int64

In [121]:
s1 + s2

1    566
2    466
3    366
4    266
5    166
dtype: int64

In [122]:
s1 * s2

1     6105
2     9768
3    10989
4     9768
5     6105
dtype: int64

In [123]:
s1 - s2

1   -544
2   -422
3   -300
4   -178
5    -56
dtype: int64

In [132]:
data = df['Name'][0:5]

list

In [134]:
pd.DataFrame(list(data),index = ['a','b','c','d','e'])

                                                   0
a                            Braund, Mr. Owen Harris
b  Cumings, Mrs. John Bradley (Florence Briggs Th...
c                             Heikkinen, Miss. Laina
d       Futrelle, Mrs. Jacques Heath (Lily May Peel)
e                           Allen, Mr. William Henry